## SQLQuery1_1.sql

In [ ]:
use TestDB1;

go
create view PR1
as
select
	name,
	capital,
	square,
	population,
	continent
from
	Countries
where
	population < 5000000
	and
	square > 100000
go
select
	name,
	capital,
	square,
	population,
	continent
from
	PR1

## SQLQuery1_2.sql

In [ ]:
use TestDB1;

go
create view PR2
(
	continent,
	square,
	population	
)
as
select 
	continent,
	Sum(square),
	Sum(population)
from
	Countries
group by
	continent
go
select
	
	continent,
	square,
	population
from
	PR2

## SQLQuery1_3.sql

In [ ]:
use Lab8;

go
create view PR3
(
	Surname,
	Job,
	Title,
	Degree,
	Workplace,
	Salary
)
as select
	Fio,
	Dolgn,
	Zvanie,
	Stepen,
	NKaf,
	Zarplata
from
	Sotrudnik C
	inner join Prepodavatel P on C.TabNom = P.TabNom_pr
	inner join Kafedra K on C.ShifrKaf_Sotr = k.ShifrKaf
go
select
	Surname,
	Job,
	Title,
	Degree,
	Workplace,
	Salary
from
	PR3

## SQLQuery1_4.sql

In [ ]:
declare @PR4 TABLE
(
   [WeekNumber] int,
   [DateStart] date,
   [DateEnd] date
)
declare @T as date, @N int=1
set @T=cast(year(getdate()) as char(4))+'0101'
while DATENAME(weekday,@T)>1
   set @T=Dateadd(Day,-1,@T)
print DATENAME(week,@T)
while year(@T)<year(dateadd(year,1,getdate()))
begin
    insert
    @PR4
	values
	  (@N,@T,dateadd(day,6,@T))
	  set @T=dateadd(day,7,@T)
	  set @N=@N+1
end
select
	[WeekNumber],
    [DateStart],
    [DateEnd]
from @PR4

## SQLQuery1_5.sql

In [ ]:
use TestDB1;

declare @PR5 Table
(
   Name nvarchar(30),
   Capital nvarchar(30),
   Square bigint,
   Population int,
   Continent nvarchar(30)
)
insert into @PR5
select 
    name,
	capital,
	square,
	population,
	continent
from Countries
where square*1000<(select avg(square) from Countries)
select
	Name,
    Capital,
    Square,
    Population,
    Continent
from @PR5

## SQLQuery1_6.sql

In [ ]:
use TestDatabas;

select
DATENAME(month, data) as [Month Name],
count(distinct Kod) as [Exams Number],
count(distinct RegNom) as [Students Number] into
  #PR6
from Ozenka
group by
  DATENAME(week, data)
select * from #PR6

## SQLQuery1_7.sql

In [ ]:
use TestDB1;

create table ##PR7
(
   Name varchar(50),
   Density float
)
insert into ##PR7
(
   Name, 
   Density
)
select
	name,
	round(population/square,0)as Density
from
	Countries
select*from ##PR7

## SQLQuery1_8.sql

In [ ]:
use Lab8;

with AverageCafedraSalary as
(
select
    K.NKaf as Workplace,
	K.ShifrKaf,
	avg(Zarplata) as [Average salary] 
	from Sotrudnik C
	inner join Kafedra K on C.ShifrKaf_Sotr=K.ShifrKaf
	group by
	K.NKaf,K.ShifrKaf
)
select
   C.FIO,
   C.Zarplata,
   ACS.Workplace,
   ACS.[Average salary]
from
   Sotrudnik C
   inner join AverageCafedraSalary ACS on C.ShifrKaf_Sotr=ACS.ShifrKaf where
   C.Zarplata<ACS.[Average salary]